# SpiralRunRadiusTooSmallFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..SpiralRunRadiusTooSmallFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The radius value for the run is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpiralRunRadiusTooSmallFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpiralRunRadiusTooSmallFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace